{
	"version": "https://jsonfeed.org/version/1",
	"title": "Techyte",
	"icon": "https://micro.blog/Techyte/avatar.jpg",
	"home_page_url": "https://blog.techyte.net/",
	"feed_url": "https://blog.techyte.net/feed.json",
	"items": [
		
			{
				"id": "http://techyte.micro.blog/2024/10/29/propaganda-and-outcome.html",
				"title": "Propaganda and Outcome Bias",
				"content_html": "<p>So, in English recently we have been doing a unit called “power and propaganda”. In that unit, one of the things we have talked about (been lectured to about) is the 2 sides of propaganda. They point to nazi propaganda during ww2 as a blatant example of propaganda being used to galvanise people to commit horrendous acts, but also point towards British propaganda and how it was for a good cause, the argument being that not all propaganda is bad. Now, I take issue with this, not on a personal level, of course I believe allied propaganda was justified and that the nazis should be condemned to history, but when teaching about the intricate topic that is propaganda I think some slight things are being overlooked.</p>\n<p>For one thing, the British won the war, history is told by the winners after all, if the Germans had won they probably would have been teaching their kids the exact opposite. In the universe of 1984, people are probably told that the propaganda around them is necessary to unite and stand strong (or something). The implication that there is good propaganda and bad propaganda is to simple, to binary, I think there will always be a need for propaganda, if only to teach, for at the end of the day all it is is presenting a message.</p>\n<p>Teaching kids that just because the British were (in today’s mind) morally right, therefore their propaganda was justified is failing to acknowledge that the British DID a win the war, and that that bias exists. I’m not sure what an alternative would be, but starting by acknowledging that the bias is there I think would be a bit better.</p>\n<p>Idk, this really only ticked me off once and it’s not really a big problem, it more just connects with a broader discussion around how the victors of a war have all the influence over how they are portrayed.</p>\n",
				"content_text": "So, in English recently we have been doing a unit called “power and propaganda”. In that unit, one of the things we have talked about (been lectured to about) is the 2 sides of propaganda. They point to nazi propaganda during ww2 as a blatant example of propaganda being used to galvanise people to commit horrendous acts, but also point towards British propaganda and how it was for a good cause, the argument being that not all propaganda is bad. Now, I take issue with this, not on a personal level, of course I believe allied propaganda was justified and that the nazis should be condemned to history, but when teaching about the intricate topic that is propaganda I think some slight things are being overlooked.\r\n\r\nFor one thing, the British won the war, history is told by the winners after all, if the Germans had won they probably would have been teaching their kids the exact opposite. In the universe of 1984, people are probably told that the propaganda around them is necessary to unite and stand strong (or something). The implication that there is good propaganda and bad propaganda is to simple, to binary, I think there will always be a need for propaganda, if only to teach, for at the end of the day all it is is presenting a message.\r\n\r\nTeaching kids that just because the British were (in today’s mind) morally right, therefore their propaganda was justified is failing to acknowledge that the British DID a win the war, and that that bias exists. I’m not sure what an alternative would be, but starting by acknowledging that the bias is there I think would be a bit better.\r\n\r\nIdk, this really only ticked me off once and it’s not really a big problem, it more just connects with a broader discussion around how the victors of a war have all the influence over how they are portrayed.\r\n",
				"date_published": "2024-10-29T22:34:28+11:00",
				"url": "https://blog.techyte.net/2024/10/29/propaganda-and-outcome.html",
				"tags": ["GeopoliticsHistory","Philosophy"]
			},
			{
				"id": "http://techyte.micro.blog/2024/10/14/i-hate-writing.html",
				"title": "I hate writing blog posts",
				"content_html": "<p>they have a habit of making me cringe after a while</p>\n<p>kind of like leaving cheese on the counter</p>\n<p>after a year or so you regret all the decisions that led up to it</p>\n",
				"content_text": "they have a habit of making me cringe after a while\r\n\r\nkind of like leaving cheese on the counter\r\n\r\nafter a year or so you regret all the decisions that led up to it\n",
				"date_published": "2024-10-14T23:12:44+11:00",
				"url": "https://blog.techyte.net/2024/10/14/i-hate-writing.html"
			},
			{
				"id": "http://techyte.micro.blog/2024/10/08/democracy-and-data.html",
				"title": "Democracy and Data",
				"content_html": "<p>Over time I’ve heard a lot of pushback to the idea that you need to protect your personal information and privacy, “I don’t mind personalised ads”, “so what if they have it, they’re not going to do anything with it”, etc. To those people (and for my own entertainment and enjoyment) I present this (admittedly probably not unique) argument.</p>\n<p>Imagine the government had access to everything about you. What you wrote, what you watched, what you said, what you questioned, what you believed, what you thought you understood, and more. Now, assuming you live in a half decent democracy, you probably have some control over what happens to this information, government can’t share it, can’t do much with it, can’t leak it, so on. Most people would say this isn’t great. They would call it authoritarian, totalitarian, distopian and other buzzwords for bad governments. Now imagine this scenario, but this information is held by a random person, all you know about them is their name, they have all the same information, but you have no control over them, they are not beholden to you through any means, they can do what they wish with the data. All that’s limiting them is a slap on the wrist from someone you picked out, whenever they do something wrong.</p>\n<p>This is basically what is happening, right now.</p>\n<p>While some would argue that this is a strawmaned version of the system in place, I maintain that you can still clearly see the inherent problem, authoritarian organisations having near complete control over the entire populations personal information. This is why people say don’t tell corporations your real birth date, don’t tell them your name, and why we get so worried when Facebook starts forcing people to put in their real name.</p>\n<p>You wouldn’t get into a white van, don’t sign up for Facebook.</p>\n<p>Thanks for reading.</p>\n",
				"content_text": "Over time I’ve heard a lot of pushback to the idea that you need to protect your personal information and privacy, “I don’t mind personalised ads”, “so what if they have it, they’re not going to do anything with it”, etc. To those people (and for my own entertainment and enjoyment) I present this (admittedly probably not unique) argument. \n\nImagine the government had access to everything about you. What you wrote, what you watched, what you said, what you questioned, what you believed, what you thought you understood, and more. Now, assuming you live in a half decent democracy, you probably have some control over what happens to this information, government can’t share it, can’t do much with it, can’t leak it, so on. Most people would say this isn’t great. They would call it authoritarian, totalitarian, distopian and other buzzwords for bad governments. Now imagine this scenario, but this information is held by a random person, all you know about them is their name, they have all the same information, but you have no control over them, they are not beholden to you through any means, they can do what they wish with the data. All that’s limiting them is a slap on the wrist from someone you picked out, whenever they do something wrong.\n\nThis is basically what is happening, right now.\n\nWhile some would argue that this is a strawmaned version of the system in place, I maintain that you can still clearly see the inherent problem, authoritarian organisations having near complete control over the entire populations personal information. This is why people say don’t tell corporations your real birth date, don’t tell them your name, and why we get so worried when Facebook starts forcing people to put in their real name.\n\nYou wouldn’t get into a white van, don’t sign up for Facebook.\n\nThanks for reading.\n",
				"date_published": "2024-10-08T23:24:58+11:00",
				"url": "https://blog.techyte.net/2024/10/08/democracy-and-data.html",
				"tags": ["Computer Science","Philosophy"]
			},
			{
				"id": "http://techyte.micro.blog/2024/09/08/why-do-us.html",
				"title": "Why do US elections drag on for so long?",
				"content_html": "<p>Been thinking about the discrepancy between the United States campaign season vs most other western democracy’s. The us campaigns last for months and months, candidates spending literally billions on pushing themselves forward. This is in contrast to most of the rest of the world where “election season” really only lasts a few weeks. You going about your life and then it’s like “oh ok I guess there is an election in a few weeks”. The only indicator are maybe some signs around that advertise a candidate.</p>\n<p>One potential reason for this could be the age of US elections. Over time they may have simply gotten longer because people realised that if you campaign for longer you’re more likely to get more votes. This makes sense because US democracy is arguably one of not the oldest surviving democracy in the world. On the other hand though, if that were the case then burgeoning democracy’s should have really short campaign times compared to established ones. But this doesn’t hold up either, with places like Spain and Latin American nations current democratic systems being younger than say, France or the UK and yet still having similar campaign lengths. No. I think the problem, if we call it that, is more subtle.</p>\n<p>Part of the reason I believe that us election cycles last so much longer than others, is because of the timing of an election. The US is very unique in that presidential elections are held at predictable, consistent times, every 4 years, in November. This means that candidates can time everything out years in advance, planning to the minute when and where parts of the campaign will occur. In contrast, Australia for example, does have a maximum term length, but the prime minister can just call an election whenever they want, leading to unpredictability in the election timing. This means campaigns will hold out until they know when it will occur to begin, which usually only leaves them a few weeks. The reason they wait is because they don’t want to start to early or to late, to late and they give their opponents a leg up, and they don’t want to start early because of the other half of this coin.</p>\n<p>In most major democracy’s across the globe, campaign spending is heavily regulated, every cent, dollar, pound or euro that is spent is recorded and monitored, candidates are required to stay within a certain limit, in order to prevent, well, a situation like what is the case in the US. Yet again, America is unique in that there are basically no limits on the amount of money candidates can spend, sure the people who run the election need to know what campaigns are spending their money on, but they don’t limit it. This is the reason I believe US elections are so bloated, drawn out and just take forever. Candidates can spend as much money as they want meaning they don’t have to conserve resources the way other candidates in other democracy’s do, they just gogogo from the moment they can with nothing to stop them.</p>\n<p>US elections aren’t longer because the US candidates are smarter than the rest of the world, they are longer, because they can be.</p>\n<p>tried something a bit different here, in my head it sorta plays out like a mystery crime thing, not sure it comes across as that tho, anyway I hope you found this interesting and/or laughed because I got something wrong, either way. Bye</p>\n",
				"content_text": "Been thinking about the discrepancy between the United States campaign season vs most other western democracy’s. The us campaigns last for months and months, candidates spending literally billions on pushing themselves forward. This is in contrast to most of the rest of the world where “election season” really only lasts a few weeks. You going about your life and then it’s like “oh ok I guess there is an election in a few weeks”. The only indicator are maybe some signs around that advertise a candidate.\r\n\r\n\r\nOne potential reason for this could be the age of US elections. Over time they may have simply gotten longer because people realised that if you campaign for longer you’re more likely to get more votes. This makes sense because US democracy is arguably one of not the oldest surviving democracy in the world. On the other hand though, if that were the case then burgeoning democracy’s should have really short campaign times compared to established ones. But this doesn’t hold up either, with places like Spain and Latin American nations current democratic systems being younger than say, France or the UK and yet still having similar campaign lengths. No. I think the problem, if we call it that, is more subtle.\r\n\r\n\r\nPart of the reason I believe that us election cycles last so much longer than others, is because of the timing of an election. The US is very unique in that presidential elections are held at predictable, consistent times, every 4 years, in November. This means that candidates can time everything out years in advance, planning to the minute when and where parts of the campaign will occur. In contrast, Australia for example, does have a maximum term length, but the prime minister can just call an election whenever they want, leading to unpredictability in the election timing. This means campaigns will hold out until they know when it will occur to begin, which usually only leaves them a few weeks. The reason they wait is because they don’t want to start to early or to late, to late and they give their opponents a leg up, and they don’t want to start early because of the other half of this coin.\r\n\r\nIn most major democracy’s across the globe, campaign spending is heavily regulated, every cent, dollar, pound or euro that is spent is recorded and monitored, candidates are required to stay within a certain limit, in order to prevent, well, a situation like what is the case in the US. Yet again, America is unique in that there are basically no limits on the amount of money candidates can spend, sure the people who run the election need to know what campaigns are spending their money on, but they don’t limit it. This is the reason I believe US elections are so bloated, drawn out and just take forever. Candidates can spend as much money as they want meaning they don’t have to conserve resources the way other candidates in other democracy’s do, they just gogogo from the moment they can with nothing to stop them.\r\n\r\nUS elections aren’t longer because the US candidates are smarter than the rest of the world, they are longer, because they can be.\r\n\r\ntried something a bit different here, in my head it sorta plays out like a mystery crime thing, not sure it comes across as that tho, anyway I hope you found this interesting and/or laughed because I got something wrong, either way. Bye\n",
				"date_published": "2024-09-08T23:31:13+11:00",
				"url": "https://blog.techyte.net/2024/09/08/why-do-us.html",
				"tags": ["GeopoliticsHistory","Philosophy"]
			},
			{
				"id": "http://techyte.micro.blog/2024/07/21/i-made-a.html",
				
				"content_html": "<p>I made a video!\nIf you could go watch it that would be amazing, I&rsquo;m really proud :)\n<a href=\"https://youtu.be/zOq2DtjB96I\">youtu.be/zOq2DtjB9&hellip;</a></p>\n",
				"content_text": "I made a video!\r\nIf you could go watch it that would be amazing, I'm really proud :)\r\n[youtu.be/zOq2DtjB9...](https://youtu.be/zOq2DtjB96I)\n",
				"date_published": "2024-07-21T23:38:13+11:00",
				"url": "https://blog.techyte.net/2024/07/21/i-made-a.html"
			},
			{
				"id": "http://techyte.micro.blog/2024/07/17/hearts-of-iron.html",
				"title": "Hearts Of Iron 4",
				"content_html": "<p>So my latest hobby for the past week or so has been a grand strategy world war 2 game, hearts of iron 4 (or hoi4 if you don’t have much time). I actually bought the game ages ago cause a friend of mine had it and it looked interesting, but because it’s such a complicated mess of systems and I was overwhelmed I really only sat down and learnt how to play recently. And boy howdy have I learnt how to play (pretty poorly but we will get to that).</p>\n<p>(For a bit of background in the game you pick a country and you start playing as that country, waging wars, building industry, changing the government and so on. It starts you off in 1939, and because I generally have the ‘historical focuses’ option ticked, other countries will follow what they did in real life at that time)\nThe tutorial for the game is what I started off with. It makes you pick Italy because they start off at war with Ethiopia so it gives you a chance to learn the ropes and such. Long story short, it took me 3 restarts and many desperate last stands before I finally got a hang of the combat and managed to defeat and conquer of all Abyssinia. Wasn’t a great start but I had a good grasp of the game by that point. Anyway, in my infinite wisdom (and presumably the high that came from actually winning a war) my next goal was war with Germany. This ended as you might have expected, I was overrun in a matter of months and a civil war started.</p>\n<p>After that stunning performance I decided to take it a bit more slowly and tried focusing a bit more on the conquering land through the games focus trees, diplomacy and decisions mechanics. This led to me to guaranteeing Austrias independence (I think I was a bit salty about the last run) to try and contain German expansion, this once again, went basically the way you would expect, Germany tried to take over, I tried to stop them, I failed. But by this point I had actually learnt a bit about combat and was doing reasonably well in defending my territory (the Germans were still advancing mind you, just slower than they otherwise would have). It probably also helped that I had managed to secure the annexation of Albania and was puppeting Yugoslavia. Either way, that run ended the same way as the last, civil war, giving up, starting over.</p>\n<p>After my failed attempts at running Italy I decided to try my hand at the night USSR! With a stunning industrial base and a virtually unlimited supply of troops the soviets are apparently a really good beginner country to play. In my run I tried to follow the advice of people online, I built up my factories and developed my industry ahead of the upcoming conflicts. My mistake was trying to do to many things at once, I was trying to conquer the Baltic countries, go to war with Finland, and preemptively invade Germany, all at the same time. In the end, I got bogged down in Finland for longer than I needed to, foolishly denying a peace offer, thinking I could afford to take the rest of the country, and then when Germany invaded, I had no real plan as to how to counter it and eventually just gave up. Either way, not an amazing run but I learnt never to say no to a peace offer.</p>\n<p>Now we get to my current run, Australia! Immediately after starting I realised that Australia didn’t have much in the way of infrastructure and factories, meaning it would be harder for me to wage war and such. I am doing my best to rectify this by just building as much as I can, developing until I can create a decent base to work on. In the meantime I started steering towards communism! Joining the Comintern and turning New Zealand into my puppet. This eventually led to a civil war, which, because of how large and empty the place is, is a real peace of cake, just kinda walk in and claim back the land. The problem arose when New Zealand joined the opposit side, dragging out the war. I ended up attempting an invasion of the southern island but I haven’t done naval invasions in the game before and ended up losing all my divisions lol.</p>\n<p>And that’s pretty much where I’m at rn, I’m having a blast learning how to play and all I can hope is that it doesn’t fill my mind with alternate history that I will mix up with the real stuff :p</p>\n",
				"content_text": "So my latest hobby for the past week or so has been a grand strategy world war 2 game, hearts of iron 4 (or hoi4 if you don’t have much time). I actually bought the game ages ago cause a friend of mine had it and it looked interesting, but because it’s such a complicated mess of systems and I was overwhelmed I really only sat down and learnt how to play recently. And boy howdy have I learnt how to play (pretty poorly but we will get to that). \n\n(For a bit of background in the game you pick a country and you start playing as that country, waging wars, building industry, changing the government and so on. It starts you off in 1939, and because I generally have the ‘historical focuses’ option ticked, other countries will follow what they did in real life at that time) \nThe tutorial for the game is what I started off with. It makes you pick Italy because they start off at war with Ethiopia so it gives you a chance to learn the ropes and such. Long story short, it took me 3 restarts and many desperate last stands before I finally got a hang of the combat and managed to defeat and conquer of all Abyssinia. Wasn’t a great start but I had a good grasp of the game by that point. Anyway, in my infinite wisdom (and presumably the high that came from actually winning a war) my next goal was war with Germany. This ended as you might have expected, I was overrun in a matter of months and a civil war started.\n\nAfter that stunning performance I decided to take it a bit more slowly and tried focusing a bit more on the conquering land through the games focus trees, diplomacy and decisions mechanics. This led to me to guaranteeing Austrias independence (I think I was a bit salty about the last run) to try and contain German expansion, this once again, went basically the way you would expect, Germany tried to take over, I tried to stop them, I failed. But by this point I had actually learnt a bit about combat and was doing reasonably well in defending my territory (the Germans were still advancing mind you, just slower than they otherwise would have). It probably also helped that I had managed to secure the annexation of Albania and was puppeting Yugoslavia. Either way, that run ended the same way as the last, civil war, giving up, starting over.\n\nAfter my failed attempts at running Italy I decided to try my hand at the night USSR! With a stunning industrial base and a virtually unlimited supply of troops the soviets are apparently a really good beginner country to play. In my run I tried to follow the advice of people online, I built up my factories and developed my industry ahead of the upcoming conflicts. My mistake was trying to do to many things at once, I was trying to conquer the Baltic countries, go to war with Finland, and preemptively invade Germany, all at the same time. In the end, I got bogged down in Finland for longer than I needed to, foolishly denying a peace offer, thinking I could afford to take the rest of the country, and then when Germany invaded, I had no real plan as to how to counter it and eventually just gave up. Either way, not an amazing run but I learnt never to say no to a peace offer.\n\nNow we get to my current run, Australia! Immediately after starting I realised that Australia didn’t have much in the way of infrastructure and factories, meaning it would be harder for me to wage war and such. I am doing my best to rectify this by just building as much as I can, developing until I can create a decent base to work on. In the meantime I started steering towards communism! Joining the Comintern and turning New Zealand into my puppet. This eventually led to a civil war, which, because of how large and empty the place is, is a real peace of cake, just kinda walk in and claim back the land. The problem arose when New Zealand joined the opposit side, dragging out the war. I ended up attempting an invasion of the southern island but I haven’t done naval invasions in the game before and ended up losing all my divisions lol.\n\nAnd that’s pretty much where I’m at rn, I’m having a blast learning how to play and all I can hope is that it doesn’t fill my mind with alternate history that I will mix up with the real stuff :p\n",
				"date_published": "2024-07-18T00:31:52+11:00",
				"url": "https://blog.techyte.net/2024/07/17/hearts-of-iron.html",
				"tags": ["GeopoliticsHistory","Games"]
			},
			{
				"id": "http://techyte.micro.blog/2024/06/28/first-us-presidential.html",
				"title": "First US presidential debate",
				"content_html": "<p>US presidential debate just happened… and uhhhh, apparently Biden has a cold, no one can understand what he is saying, and the felon is winning…</p>\n<p>all I can say is that the Democrats must be freaking the fuck out.</p>\n<p>I didn’t manage to catch the actual debate but from a cursory reading of some news articles (most very sympathetic to the democrats, just trying to be transparent about my own biases lol) it didn’t go well for Biden, kept mumbling, staring off into the distance, rasping and letting the felon walk all over him. Not exactly an ideal combination.</p>\n<p>if you wonder why me, an Australian, am commenting on US polotics, I will direct you to the map below:</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "US presidential debate just happened… and uhhhh, apparently Biden has a cold, no one can understand what he is saying, and the felon is winning…\r\n\r\nall I can say is that the Democrats must be freaking the fuck out.\r\n\r\n I didn’t manage to catch the actual debate but from a cursory reading of some news articles (most very sympathetic to the democrats, just trying to be transparent about my own biases lol) it didn’t go well for Biden, kept mumbling, staring off into the distance, rasping and letting the felon walk all over him. Not exactly an ideal combination.\r\n\r\nif you wonder why me, an Australian, am commenting on US polotics, I will direct you to the map below:\n\n<img src=\"uploads/2024/img-5842.webp\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2024-06-29T00:11:39+11:00",
				"url": "https://blog.techyte.net/2024/06/28/first-us-presidential.html",
				"tags": ["GeopoliticsHistory"]
			},
			{
				"id": "http://techyte.micro.blog/2024/06/17/most-relegions-really.html",
				
				"content_html": "<p>most relegions really are just super successful marketing campaigns</p>\n",
				"content_text": "most relegions really are just super successful marketing campaigns\n",
				"date_published": "2024-06-18T00:43:42+11:00",
				"url": "https://blog.techyte.net/2024/06/17/most-relegions-really.html"
			},
			{
				"id": "http://techyte.micro.blog/2024/06/14/are-we-seeing.html",
				"title": "Are we seeing the start of a new Cold War?",
				"content_html": "<p>Been thinking about the Cold War recently and how we are seeing the same things that occurred between the us and the ussr happen between the us and china nowadays. I was on the fence about weather to classify the geopolitics of the us and china as a ‘Cold War’ because of the lack of apparent proxy conflicts, something that characterised the original Cold War greatly. Then I realised, Russia-Ukraine is partly a proxy conflict. The us obviously supports Ukraine and, and this was the part I forgot, china is basically Russia’s economic lifeline atm and I wouldn’t be surprised if Chinese weapons were being used by Russia right now. In this sense the Russian invasion of Ukraine is a proxy conflict (not necessarily characterised by military aid, but economic aid to continue fighting as well) between the United States and China. Another characteristic of the Cold War was economic completion, which is very much starting to crop up (us bans on certain exports to China) and technological competition, for example a nuclear buildup in the 20th century, and a military base buildup in the 21st. In many ways, current events and actions by both China and the United States point towards a new Cold War, and I would argue that it is very much underway.</p>\n<p>P.S: sorry if this is paced kinda weirdly, im tired and cant be bothered to edit this so here is your raw geopolitical commentary</p>\n",
				"content_text": "Been thinking about the Cold War recently and how we are seeing the same things that occurred between the us and the ussr happen between the us and china nowadays. I was on the fence about weather to classify the geopolitics of the us and china as a ‘Cold War’ because of the lack of apparent proxy conflicts, something that characterised the original Cold War greatly. Then I realised, Russia-Ukraine is partly a proxy conflict. The us obviously supports Ukraine and, and this was the part I forgot, china is basically Russia’s economic lifeline atm and I wouldn’t be surprised if Chinese weapons were being used by Russia right now. In this sense the Russian invasion of Ukraine is a proxy conflict (not necessarily characterised by military aid, but economic aid to continue fighting as well) between the United States and China. Another characteristic of the Cold War was economic completion, which is very much starting to crop up (us bans on certain exports to China) and technological competition, for example a nuclear buildup in the 20th century, and a military base buildup in the 21st. In many ways, current events and actions by both China and the United States point towards a new Cold War, and I would argue that it is very much underway.\r\n\r\n\r\nP.S: sorry if this is paced kinda weirdly, im tired and cant be bothered to edit this so here is your raw geopolitical commentary\n",
				"date_published": "2024-06-14T01:25:52+11:00",
				"url": "https://blog.techyte.net/2024/06/14/are-we-seeing.html",
				"tags": ["GeopoliticsHistory"]
			},
			{
				"id": "http://techyte.micro.blog/2024/05/08/the-horseshoe-political.html",
				"title": "The horseshoe political spectrum.",
				"content_html": "<p>Something interesting I’ve been mulling over recently is the idea that instead of a linear left-right political spectrum, its more like a horsesoe. As you get closer to one end you actually get closer to the other and at the very end there is almost nothing differentiating you from the other side other than that small gap. You can see where this line of thinking makes sense when you look at extreme right wing facist governments (eg. Hitler, Mussolini) compared to extreme communist governments (Stalin, North Korea). Despite them being on complete opposite sides of the traditional spectrum, they more or less look the same to an outsider, authoritarian dictator, impoverished citizens, state propaganda and war-mongering. But put onto the horseshoe diogram it makes a whole lot more sense, the horseshoe model accounts for the extreme left/right much more neatly than the common one does.</p>\n<p>The idea is by no means perfect but its a good way of highlighting problems with the binary left/right thinking that so much of our media abides by.</p>\n",
				"content_text": "Something interesting I’ve been mulling over recently is the idea that instead of a linear left-right political spectrum, its more like a horsesoe. As you get closer to one end you actually get closer to the other and at the very end there is almost nothing differentiating you from the other side other than that small gap. You can see where this line of thinking makes sense when you look at extreme right wing facist governments (eg. Hitler, Mussolini) compared to extreme communist governments (Stalin, North Korea). Despite them being on complete opposite sides of the traditional spectrum, they more or less look the same to an outsider, authoritarian dictator, impoverished citizens, state propaganda and war-mongering. But put onto the horseshoe diogram it makes a whole lot more sense, the horseshoe model accounts for the extreme left/right much more neatly than the common one does.\r\n\r\nThe idea is by no means perfect but its a good way of highlighting problems with the binary left/right thinking that so much of our media abides by.\n",
				"date_published": "2024-05-08T23:31:56+11:00",
				"url": "https://blog.techyte.net/2024/05/08/the-horseshoe-political.html",
				"tags": ["GeopoliticsHistory","Philosophy"]
			},
			{
				"id": "http://techyte.micro.blog/2024/05/08/its-a-system.html",
				
				"content_html": "<p>its a system designed to make you think that it cannot be changed</p>\n",
				"content_text": "its a system designed to make you think that it cannot be changed\n",
				"date_published": "2024-05-08T23:18:44+11:00",
				"url": "https://blog.techyte.net/2024/05/08/its-a-system.html"
			},
			{
				"id": "http://techyte.micro.blog/2024/04/17/flappy-bird-and.html",
				"title": "Flappy Bird and learning something new",
				"content_html": "<p>So a few days ago in class we have finally started learning some basic python, nothing much, just variable types and functions. Anyway I’m talking about this because in that class I began goofing off and started to tinker with making a simple game in pygame while everyone else was making a calculator. I eventually ended on flappy bird because it fit well into the skills that I had with pygame at that point. Didn’t get far in that short class but after school I came back and actually kept working on it because it was a lot of fun.</p>\n<p>I found it fun to work on something outside a traditional game engine. I’ve tried before but never really got far but idk, it was different this time. I ended up enjoying working on it so much that I kept working on it, polishing and making interesting things like looping backgrounds, showing text, messing with sprites and collisions.</p>\n<p>All of this to say that working outside a game engine and learning something new was really refreshing (who knew…) and I hope I can do more of this kinda thing from now on, just doing something different and fun.</p>\n",
				"content_text": "So a few days ago in class we have finally started learning some basic python, nothing much, just variable types and functions. Anyway I’m talking about this because in that class I began goofing off and started to tinker with making a simple game in pygame while everyone else was making a calculator. I eventually ended on flappy bird because it fit well into the skills that I had with pygame at that point. Didn’t get far in that short class but after school I came back and actually kept working on it because it was a lot of fun. \r\n\r\nI found it fun to work on something outside a traditional game engine. I’ve tried before but never really got far but idk, it was different this time. I ended up enjoying working on it so much that I kept working on it, polishing and making interesting things like looping backgrounds, showing text, messing with sprites and collisions.\r\n\r\nAll of this to say that working outside a game engine and learning something new was really refreshing (who knew…) and I hope I can do more of this kinda thing from now on, just doing something different and fun.\n",
				"date_published": "2024-04-18T00:08:35+11:00",
				"url": "https://blog.techyte.net/2024/04/17/flappy-bird-and.html",
				"tags": ["Games","Computer Science","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2024/04/17/isreal-bash-iraniran.html",
				
				"content_html": "<p>isreal <em>bash</em> iran.\niran <em>bash</em> isreal.\nisreal: :0</p>\n",
				"content_text": "isreal *bash* iran.\niran *bash* isreal.\nisreal: :0\n",
				"date_published": "2024-04-17T23:54:47+11:00",
				"url": "https://blog.techyte.net/2024/04/17/isreal-bash-iraniran.html"
			},
			{
				"id": "http://techyte.micro.blog/2024/03/30/texas-has-a.html",
				
				"content_html": "<p>texas has a costline… idk thats just something ive never really though about before</p>\n",
				"content_text": "texas has a costline… idk thats just something ive never really though about before\n",
				"date_published": "2024-03-30T22:02:17+11:00",
				"url": "https://blog.techyte.net/2024/03/30/texas-has-a.html"
			},
			{
				"id": "http://techyte.micro.blog/2024/03/26/the-coriolis-effect.html",
				"title": "The Coriolis Effect",
				"content_html": "<p>Was absent mindedly staring at a globe of mine and I randomly started thinking about the earths spin. From the perspective of the northern hemisphere, the earth spins counterclockwise, but from the perspective of the southern hemisphere, the earth spins clockwise. It got me thinking about tornados and cyclones so I did some digging and found out about the Coriolis Effect (which I had heard of before but never knew what it did). The Coriolis Effect basically describes how moving objects not attatched to the earths surface curve over large distances (amazing article about it on <a href=\"https://education.nationalgeographic.org/resource/coriolis-effect/\">national geographic</a>). Anyway this means that the air traveling from the high pressure areas of a cyclone (outskirts) to the low pressure area (the eye) curves due to the Coriolis Effect! This is why tornados and cyclones spin!</p>\n<p>Anyway I just got caught up in a small rabbit hole and thought I’d share it 👍🏼</p>\n",
				"content_text": "Was absent mindedly staring at a globe of mine and I randomly started thinking about the earths spin. From the perspective of the northern hemisphere, the earth spins counterclockwise, but from the perspective of the southern hemisphere, the earth spins clockwise. It got me thinking about tornados and cyclones so I did some digging and found out about the Coriolis Effect (which I had heard of before but never knew what it did). The Coriolis Effect basically describes how moving objects not attatched to the earths surface curve over large distances (amazing article about it on [national geographic](https://education.nationalgeographic.org/resource/coriolis-effect/)). Anyway this means that the air traveling from the high pressure areas of a cyclone (outskirts) to the low pressure area (the eye) curves due to the Coriolis Effect! This is why tornados and cyclones spin!\r\n\r\nAnyway I just got caught up in a small rabbit hole and thought I’d share it 👍🏼\n",
				"date_published": "2024-03-26T23:25:22+11:00",
				"url": "https://blog.techyte.net/2024/03/26/the-coriolis-effect.html",
				"tags": ["Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2024/03/12/idfk-nobel-prize.html",
				"title": "idfk nobel prize money stuff",
				"content_html": "<p>okokokok.\nso.\nnobel prizes.\nalfred nobel (dude who left his fortune to start the prize stuff)\nleft them roughly 31 million SEK (c. US$186 million, €150 million in 2008)\nand\nbecause the organization responsible for managing the money of the nobel prizes is basically an investment firm\nthey have grown that ~US$186 million&hellip;\nINTO $560 MILLION\nTHEY&rsquo;VE MADE MONEY</p>\n",
				"content_text": "okokokok.\r\nso.\r\nnobel prizes.\r\nalfred nobel (dude who left his fortune to start the prize stuff)\r\nleft them roughly 31 million SEK (c. US$186 million, €150 million in 2008)\r\nand\r\nbecause the organization responsible for managing the money of the nobel prizes is basically an investment firm\r\nthey have grown that ~US$186 million...\r\nINTO $560 MILLION\r\nTHEY'VE MADE MONEY\n",
				"date_published": "2024-03-12T08:26:43+11:00",
				"url": "https://blog.techyte.net/2024/03/12/idfk-nobel-prize.html",
				"tags": ["GeopoliticsHistory","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2024/02/17/never-write-on.html",
				"title": "NEVER WRITE ON AN IPAD.txt",
				"content_html": "<p>I WRITE A REALLY FUCKING LONG BLOG POST THAT TAKES ME AGES TO EDIT AND JUST AS IM ABOUT TO PUT THE LINK TO THE VIDEO IM TALKING ABOUT THE FUCKING PAGE RELOADA AND BECAUSE MICRO.BLOG DOESENT SAVE DRAFTS IT ALL GETS LOST FOR FUCKS SAKE I WAS REALLY PROUD OF THAT.</p>\n<p>I WAS GONNA TALK ABOUT THIS VIDEO BUT FUCKING FINE I WONT: <a href=\"https://youtu.be/iDTOD94YRpY?si=klQBqTrzpZXOqgpW\">youtu.be/iDTOD94YR&hellip;</a></p>\n",
				"content_text": "I WRITE A REALLY FUCKING LONG BLOG POST THAT TAKES ME AGES TO EDIT AND JUST AS IM ABOUT TO PUT THE LINK TO THE VIDEO IM TALKING ABOUT THE FUCKING PAGE RELOADA AND BECAUSE MICRO.BLOG DOESENT SAVE DRAFTS IT ALL GETS LOST FOR FUCKS SAKE I WAS REALLY PROUD OF THAT.\r\n\r\nI WAS GONNA TALK ABOUT THIS VIDEO BUT FUCKING FINE I WONT: [youtu.be/iDTOD94YR...](https://youtu.be/iDTOD94YRpY?si=klQBqTrzpZXOqgpW)\n",
				"date_published": "2024-02-17T23:30:23+11:00",
				"url": "https://blog.techyte.net/2024/02/17/never-write-on.html"
			},
			{
				"id": "http://techyte.micro.blog/2024/02/16/i-hate-reading.html",
				
				"content_html": "<p>i hate reading my own writing how do i delete old blog posts forever aaaauuuuuggggghhhhhhhhhhhtthuehnshunwuunrhniwkismimd</p>\n",
				"content_text": "i hate reading my own writing how do i delete old blog posts forever aaaauuuuuggggghhhhhhhhhhhtthuehnshunwuunrhniwkismimd\n",
				"date_published": "2024-02-16T23:34:13+11:00",
				"url": "https://blog.techyte.net/2024/02/16/i-hate-reading.html"
			},
			{
				"id": "http://techyte.micro.blog/2024/02/16/the-lorax-and.html",
				"title": "The Lorax and Plausible Deniability",
				"content_html": "<p>(Most of the analysis from this post comes from this amazing video here: <a href=\"https://m.youtube.com/watch?v=bZGy8snXrY8\">Link</a> I’m not trying to claim that I made all of these connections I merly thought they were interesting and worth writing about to improve by writing skills)</p>\n<p>Something interesting I’ve been learning about lately is a scrapped/initial song for the lorax called ‘biggering’. First of all its an amazing song that doesent get the credit it deserves but second, it being a pre-cursor to the phenomenon of a song ‘how bad can I be’ means a lot more than meets the eye. Something that me (and the YouTuber I saw talking about this) have always wondered about is how movies like the lorax, apparently so pro environment and anti capitalism/corpratism, ever get produced by massive corporations that profit off of these things. The answer is actually pretty straight forward and is corporations oldest trick in the book, plausible deniability. They didn’t <em>know</em> that their safety systems were terrible, they feel awful for the people that died and promise it will never happen again but it wasent <em>their</em> fault. Sound familiar? This is the tried and true method for big companies that profit off of ecological damage, human suffering and the general destruction of everything that apposes them.</p>\n<p>The song ‘how bad can I be’ is the embodiment of this idea, the once-ler did’nt <em>mean</em> to cut down all the trees, it was a one time thing, he came from nothing and only because of the pressure of his family was he <em>forced</em> to destroy the planet. Not once does the once-ler look at the destruction he can caused, <em>as</em> it is happening. Sure he looks at it afterwards with a devistated and grief stricken face to show how sorry he is, but not once does the movie give the once-ler agency. Not once is the once-ler responsible or aware of the damge he is causing. This is in stark contrast to say, the antagonist of the movie, the overly comical, red herring of a villan, O’Hare. This guy is so over the top its hillarious. And thats by design, O’Hare is what the movie “<em>tries to warn you about</em>” he’s the guy to look out for! But you will never find a person so obviously devilish and geedy as O’Hare.\nThis movie tried to teach children that people like O’Hare are ones to look out for, knowing full well that they will never find that person, whilst portraying big CEO’s like the once-ler as chill goofy guys who didn’t mean to fuck up the earth, they have <strong>PLAUSIBLE DENIABILITY</strong>. This is how movies like the lorax get green-lit, as much as they spout anti-corporation talk, they portray companies in such a way to give them the goofy everyman role, the one to NOT watch out for.\nAnd this is why, ultimatly, ‘Biggering’ was cut. If you listen to it after reading this (or watching the video, it does a much better job at explaining this) you will immediately undersrand why big executives would want this song cut, ASAP. (second to being a banger) It actually gives the once-ler agency for his actions, he explicitly knows what he is doing and wants more. It goes into detail about his desire for growth, talking about his greed and pride, how ‘biggering, keeps triggering, more biggering’ It is also obviously where most of ‘how bad can I be’ gets its lyrics.</p>\n<p>Either way the song also portrays the once-ler in a very different and darker tone than most of the rest of the movie (even when he is in dark environments  he still has a funny voice to undercut the darker setting). Its an amazing rock/metal song (give me a break I know jack shit about music genres, it <em>feels</em> like those ones alright) and thats probably one of the reasons it was cut, they didn’t want to portray the once-ler as anything other than a goofy, happy, loveable guy who made some mistakes, or in other words having, say it with me, <strong>PLAUSIBLE DENIABILITY</strong>. The movie tries so hard to keep up this image that some amazing songs that both sound good and would have enhanced the overall plot of the movie, were probably cut because they portrayed the once-ler in a slightly negative tone.\nWhat ‘biggering’ eventually morphed into (how bad can I be) spits further in the face of any anti-corprate messages by being SPECIFICALLY DESIGNED TO BE CATCHY. I bet there are so many people out there that nad never watched the lorax, heard how bad can I be, and then watched the lorax because of it. They took what could have been the strongest element of the movie and mangled into a corporate product, a cruel twist of fate (wow that sounds cliche but you get my point)</p>\n<p>I haven’t read the book but I would bet that the original does a better job of representing and warning against corporations greed than this movie ever could.</p>\n<p>All this is to say that despite the editorial decisions that seem to portray the once-ler in a very specific and suspicious light, the lorax on the whole suffers as both a movie and as a genuine, anti-corporate film.</p>\n<p>The lorax is still a pretty good movie don’t get me wrong and no one should ever feel bad for enjoying it. I just think It’s important that people know through what lense the thing they are watching is being presented to them.</p>\n",
				"content_text": "(Most of the analysis from this post comes from this amazing video here: [Link](https://m.youtube.com/watch?v=bZGy8snXrY8) I’m not trying to claim that I made all of these connections I merly thought they were interesting and worth writing about to improve by writing skills)\r\n\r\nSomething interesting I’ve been learning about lately is a scrapped/initial song for the lorax called ‘biggering’. First of all its an amazing song that doesent get the credit it deserves but second, it being a pre-cursor to the phenomenon of a song ‘how bad can I be’ means a lot more than meets the eye. Something that me (and the YouTuber I saw talking about this) have always wondered about is how movies like the lorax, apparently so pro environment and anti capitalism/corpratism, ever get produced by massive corporations that profit off of these things. The answer is actually pretty straight forward and is corporations oldest trick in the book, plausible deniability. They didn’t *know* that their safety systems were terrible, they feel awful for the people that died and promise it will never happen again but it wasent *their* fault. Sound familiar? This is the tried and true method for big companies that profit off of ecological damage, human suffering and the general destruction of everything that apposes them.\r\n\r\nThe song ‘how bad can I be’ is the embodiment of this idea, the once-ler did’nt *mean* to cut down all the trees, it was a one time thing, he came from nothing and only because of the pressure of his family was he *forced* to destroy the planet. Not once does the once-ler look at the destruction he can caused, *as* it is happening. Sure he looks at it afterwards with a devistated and grief stricken face to show how sorry he is, but not once does the movie give the once-ler agency. Not once is the once-ler responsible or aware of the damge he is causing. This is in stark contrast to say, the antagonist of the movie, the overly comical, red herring of a villan, O’Hare. This guy is so over the top its hillarious. And thats by design, O’Hare is what the movie “*tries to warn you about*” he’s the guy to look out for! But you will never find a person so obviously devilish and geedy as O’Hare.\r\nThis movie tried to teach children that people like O’Hare are ones to look out for, knowing full well that they will never find that person, whilst portraying big CEO’s like the once-ler as chill goofy guys who didn’t mean to fuck up the earth, they have **PLAUSIBLE DENIABILITY**. This is how movies like the lorax get green-lit, as much as they spout anti-corporation talk, they portray companies in such a way to give them the goofy everyman role, the one to NOT watch out for.\r\nAnd this is why, ultimatly, ‘Biggering’ was cut. If you listen to it after reading this (or watching the video, it does a much better job at explaining this) you will immediately undersrand why big executives would want this song cut, ASAP. (second to being a banger) It actually gives the once-ler agency for his actions, he explicitly knows what he is doing and wants more. It goes into detail about his desire for growth, talking about his greed and pride, how ‘biggering, keeps triggering, more biggering’ It is also obviously where most of ‘how bad can I be’ gets its lyrics.\r\n\r\nEither way the song also portrays the once-ler in a very different and darker tone than most of the rest of the movie (even when he is in dark environments  he still has a funny voice to undercut the darker setting). Its an amazing rock/metal song (give me a break I know jack shit about music genres, it *feels* like those ones alright) and thats probably one of the reasons it was cut, they didn’t want to portray the once-ler as anything other than a goofy, happy, loveable guy who made some mistakes, or in other words having, say it with me, **PLAUSIBLE DENIABILITY**. The movie tries so hard to keep up this image that some amazing songs that both sound good and would have enhanced the overall plot of the movie, were probably cut because they portrayed the once-ler in a slightly negative tone.\r\nWhat ‘biggering’ eventually morphed into (how bad can I be) spits further in the face of any anti-corprate messages by being SPECIFICALLY DESIGNED TO BE CATCHY. I bet there are so many people out there that nad never watched the lorax, heard how bad can I be, and then watched the lorax because of it. They took what could have been the strongest element of the movie and mangled into a corporate product, a cruel twist of fate (wow that sounds cliche but you get my point)\r\n\r\nI haven’t read the book but I would bet that the original does a better job of representing and warning against corporations greed than this movie ever could.\r\n\r\nAll this is to say that despite the editorial decisions that seem to portray the once-ler in a very specific and suspicious light, the lorax on the whole suffers as both a movie and as a genuine, anti-corporate film.\r\n\r\nThe lorax is still a pretty good movie don’t get me wrong and no one should ever feel bad for enjoying it. I just think It’s important that people know through what lense the thing they are watching is being presented to them.\n",
				"date_published": "2024-02-16T23:29:10+11:00",
				"url": "https://blog.techyte.net/2024/02/16/the-lorax-and.html",
				"tags": ["Climate Change","Movies","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2024/02/15/australian-vs-us.html",
				"title": "Australian vs U.S gun laws",
				"content_html": "<p>Something interesting I learnt today: A major difference between gun regulation in Australia compared to the U.S is that in Australia it is stated in law and in the U.S it is written into the constitution. Australia&rsquo;s gun laws (as they are today) originated from the <a href=\"https://en.wikipedia.org/wiki/National_Firearms_Agreement\">National Firearms Agreement</a> (1996), after the <a href=\"https://en.wikipedia.org/wiki/Port_Arthur_massacre_(Australia)\">Port Arthur Massacre</a>.</p>\n<p>This means that in Australia gun regulations are much easier to change and tweak over time as all it requires is a law to pass rather than an amendment to our constitution. This however IS the case in the U.S, where the constitution explicitly states that all Americans have a &lsquo;<em>Right to bear arms</em>&rsquo;. Since a full amendment is a much bigger deal politically than a simple change to a law (which happens all the time) it is a lot harder for the U.S to change its gun laws than it is for Australia.</p>\n<p>This is one of the reasons the U.S, to this day, still has ridiculously loose laws around guns and firearms. It would be a massive deal for them to change this, much more than it should be.</p>\n<p>I am actively researching WHY it is a bigger deal which leads me to actually try to figure out how Australia&rsquo;s and the U.S government actually damn works but I&rsquo;m going to save that for another post, probably later this week.</p>\n<p>Anyway bye.</p>\n",
				"content_text": "Something interesting I learnt today: A major difference between gun regulation in Australia compared to the U.S is that in Australia it is stated in law and in the U.S it is written into the constitution. Australia's gun laws (as they are today) originated from the [National Firearms Agreement](https://en.wikipedia.org/wiki/National_Firearms_Agreement) (1996), after the [Port Arthur Massacre](https://en.wikipedia.org/wiki/Port_Arthur_massacre_(Australia)). \r\n\r\nThis means that in Australia gun regulations are much easier to change and tweak over time as all it requires is a law to pass rather than an amendment to our constitution. This however IS the case in the U.S, where the constitution explicitly states that all Americans have a '*Right to bear arms*'. Since a full amendment is a much bigger deal politically than a simple change to a law (which happens all the time) it is a lot harder for the U.S to change its gun laws than it is for Australia.\r\n\r\nThis is one of the reasons the U.S, to this day, still has ridiculously loose laws around guns and firearms. It would be a massive deal for them to change this, much more than it should be. \r\n\r\nI am actively researching WHY it is a bigger deal which leads me to actually try to figure out how Australia's and the U.S government actually damn works but I'm going to save that for another post, probably later this week.\r\n\r\nAnyway bye.\n",
				"date_published": "2024-02-15T13:59:23+11:00",
				"url": "https://blog.techyte.net/2024/02/15/australian-vs-us.html",
				"tags": ["GeopoliticsHistory","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2024/02/05/hole-in-one.html",
				"title": "Hole in one… Year!",
				"content_html": "<p>Today I continued my now habbit of switching projects daily by finishing what I wanted to do with the mining game (infinite world and saving/loading) before I was reminded of a game me and a friend made a while ago for a game jam that we wanted to keep working on. Long story short today I added multiplayer to this: <a href=\"https://techyte.itch.io/hole-in-1-year\">Hole in one… Year!</a>.</p>\n<p>We are also working on adding cosmetics that show up both in single and multiplayer (<a href=\"https://justuraveragedud.itch.io\">Bread</a>, the friend I’m working with has made some amazing cosmetic items that I can’t wait to implement into the game). Because of our plans for the game we havent yet released the multiplayer (and all the other tweaks we have made since the game jam) onto itch. We are waiting to finish cosmetics + some other things before we do that. We havent even let most of our other friends know we are working on it again (shows them for not reading my blog).</p>\n<p>Anyway I’m actually really proud of myself for finishing an update like this in a single day to such a high standard and I can’t wait to impress the 1 person (my Dad) that reads my blog when it releases.</p>\n<p>Or I loose interest in the project again and it never ends up seeing the light of day but on this side of the internet we try to stay positive so lets hope that never happens 👍</p>\n",
				"content_text": "Today I continued my now habbit of switching projects daily by finishing what I wanted to do with the mining game (infinite world and saving/loading) before I was reminded of a game me and a friend made a while ago for a game jam that we wanted to keep working on. Long story short today I added multiplayer to this: [Hole in one… Year!](https://techyte.itch.io/hole-in-1-year).\r\n\r\nWe are also working on adding cosmetics that show up both in single and multiplayer ([Bread](https://justuraveragedud.itch.io), the friend I’m working with has made some amazing cosmetic items that I can’t wait to implement into the game). Because of our plans for the game we havent yet released the multiplayer (and all the other tweaks we have made since the game jam) onto itch. We are waiting to finish cosmetics + some other things before we do that. We havent even let most of our other friends know we are working on it again (shows them for not reading my blog).\r\n\r\nAnyway I’m actually really proud of myself for finishing an update like this in a single day to such a high standard and I can’t wait to impress the 1 person (my Dad) that reads my blog when it releases.\r\n\r\nOr I loose interest in the project again and it never ends up seeing the light of day but on this side of the internet we try to stay positive so lets hope that never happens 👍\n",
				"date_published": "2024-02-05T22:58:37+11:00",
				"url": "https://blog.techyte.net/2024/02/05/hole-in-one.html",
				"tags": ["Games","Computer Science","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2024/02/04/procedural-generation-mayhem.html",
				"title": "Procedural Generation Mayhem",
				"content_html": "<p>So ages and ages ago I had a really early build of a kind of terraria/minecraft inspired 2d side scrolling procedural generation simulator. It was mostly built of of copied code and I had no idea how the procedural generation part of it worked but I was really proud of it and even managed to get a working chunk streaming and save and load system. So today I thought I would open it and just fuck around adding stuff that I felt like, but on opening it, it was so unstable that it wouldn&rsquo;t actually run for me so I ended up saying &lsquo;fuck it&rsquo; and making a new branch of the repo to re-write it and hopefully get some experience making an actual procedural game myself.</p>\n<p>I knew the basics of Perlin noise and heighmaps and all that jazz but I decided now was to time to see if I had what it takes to make it myself from scratch and so far I think I&rsquo;ve done pretty well.</p>\n<p>I kept a bunch of the player code (no reason re-making that when I already have a perfectly fine bean running around) and sprites but all of the terrain, chunking, and block systems are now gone. As of writing I have gotten a basic setup for chunks (so in future I can work on infinite terrain) and some VERY basic Perlin noise based procedural generation. I&rsquo;ve got a lot of numbers I can fuck around with and I&rsquo;ve made something that looks promising (See image below).</p>\n<p>If you are interested in the code I&rsquo;ve gotten so far its on the GitHub Repository here: <a href=\"https://github.com/Techyte/MiningGameBackups/tree/Re-Write\">Mining Game Re-Write</a></p>\n<p>The values I am using for the generation can also be seen in the attached images</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "So ages and ages ago I had a really early build of a kind of terraria/minecraft inspired 2d side scrolling procedural generation simulator. It was mostly built of of copied code and I had no idea how the procedural generation part of it worked but I was really proud of it and even managed to get a working chunk streaming and save and load system. So today I thought I would open it and just fuck around adding stuff that I felt like, but on opening it, it was so unstable that it wouldn't actually run for me so I ended up saying 'fuck it' and making a new branch of the repo to re-write it and hopefully get some experience making an actual procedural game myself.\r\n\r\nI knew the basics of Perlin noise and heighmaps and all that jazz but I decided now was to time to see if I had what it takes to make it myself from scratch and so far I think I've done pretty well.\r\n\r\nI kept a bunch of the player code (no reason re-making that when I already have a perfectly fine bean running around) and sprites but all of the terrain, chunking, and block systems are now gone. As of writing I have gotten a basic setup for chunks (so in future I can work on infinite terrain) and some VERY basic Perlin noise based procedural generation. I've got a lot of numbers I can fuck around with and I've made something that looks promising (See image below).\r\n\r\nIf you are interested in the code I've gotten so far its on the GitHub Repository here: [Mining Game Re-Write](https://github.com/Techyte/MiningGameBackups/tree/Re-Write)\r\n\r\nThe values I am using for the generation can also be seen in the attached images\n\n<img src=\"uploads/2024/screenshot-2024-02-04-154552.png\" width=\"600\" height=\"355\" alt=\"\"><img src=\"uploads/2024/screenshot-2024-02-04-154747.png\" width=\"548\" height=\"436\" alt=\"\">\n",
				"date_published": "2024-02-04T15:51:13+11:00",
				"url": "https://blog.techyte.net/2024/02/04/procedural-generation-mayhem.html",
				"tags": ["Games","Computer Science","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2024/01/26/mid-to-late.html",
				"title": "Mid to late 19th century",
				"content_html": "<p>Been really interested in German unification and mid to late 19th century politics in general. It’s really cool seeing how diplomatic geniuses like Otto Von Bismark navigated diplomacy and politics to get what they wanted. German unification is basically the story of clever Prussian leadership provoking European powers into attacking and then, when they win a crushing victory, using that momentum to get more states to join them. It’s amazing in a way, how it all fits together. It’s also interesting how events up until then evolved. For instance the Crimean war ended with Russia, furious at Austria, breaking ties with them. This meant that when Austria went to war with Prussia, Austria didn’t have Russian support, which probably contributed to their failures and eventual defeat.</p>\n<p>Anyway I just find the WW1 buildup is so intricate and interesting I could spend hours learning about it (and I do)</p>\n<p>Thanks for reading</p>\n",
				"content_text": "Been really interested in German unification and mid to late 19th century politics in general. It’s really cool seeing how diplomatic geniuses like Otto Von Bismark navigated diplomacy and politics to get what they wanted. German unification is basically the story of clever Prussian leadership provoking European powers into attacking and then, when they win a crushing victory, using that momentum to get more states to join them. It’s amazing in a way, how it all fits together. It’s also interesting how events up until then evolved. For instance the Crimean war ended with Russia, furious at Austria, breaking ties with them. This meant that when Austria went to war with Prussia, Austria didn’t have Russian support, which probably contributed to their failures and eventual defeat.\n\nAnyway I just find the WW1 buildup is so intricate and interesting I could spend hours learning about it (and I do)\n\nThanks for reading\n",
				"date_published": "2024-01-26T22:59:57+11:00",
				"url": "https://blog.techyte.net/2024/01/26/mid-to-late.html"
			},
			{
				"id": "http://techyte.micro.blog/2024/01/24/oh-and-because.html",
				
				"content_html": "<p>Oh and because I didn’t talk about it before I also made another thing in minecraft…, Battleship!</p>\n<p>You can watch my short showcase here:\n<a href=\"https://youtu.be/rL8iT9qu2fU?si=35sqK5I5XlXIzd1h\">Battleship With Only Command Blocks - SHOWCASE</a></p>\n",
				"content_text": "Oh and because I didn’t talk about it before I also made another thing in minecraft…, Battleship!\n\nYou can watch my short showcase here:\n[Battleship With Only Command Blocks - SHOWCASE](https://youtu.be/rL8iT9qu2fU?si=35sqK5I5XlXIzd1h)\n",
				"date_published": "2024-01-24T20:07:20+11:00",
				"url": "https://blog.techyte.net/2024/01/24/oh-and-because.html"
			},
			{
				"id": "http://techyte.micro.blog/2024/01/24/among-us-in.html",
				"title": "Among us in Minecraft",
				"content_html": "<p>Just finished/am at the point where’re im taking a break from a project. I have been making among us in minecraft for the past few weeks. It’s a full recreation of ‘the skeld’ and I’m really proud of it. Once I can be sure there are no major gameplay breaking bugs I’ll release it to the public. I know no-one will really hear about it but I will still always be proud of it.</p>\n<p>A problem I’m having at the moment is that I can only really playtest with my friends and they obviously don’t want to do that for too long to often so I’m having trouble replicating any issues we find in the one or two play sessions we have had. I think the only way to fix that would be for (if I can get them to do another session) me to run replay mod and get them to write a bit of a bug report, or even if they record while playing. Anything that could help me recreate it.</p>\n<p>It also been hard because even if I had multiple minecraft accounts to test with (I don’t) it’s always better to test with real people. Just because real people actually do things that you wouldn’t have thought of.</p>\n<p>Anyway this is just me talking about software development lol. If you’re interested I’m going to make both the world and the server setup available on GitHub. I’ll also get a version out that doesn’t require any mods (the current one uses a single mod for changing players skins in the game) so that will be cool.</p>\n<p>Anyway, thanks for reading</p>\n",
				"content_text": "Just finished/am at the point where’re im taking a break from a project. I have been making among us in minecraft for the past few weeks. It’s a full recreation of ‘the skeld’ and I’m really proud of it. Once I can be sure there are no major gameplay breaking bugs I’ll release it to the public. I know no-one will really hear about it but I will still always be proud of it.\n\nA problem I’m having at the moment is that I can only really playtest with my friends and they obviously don’t want to do that for too long to often so I’m having trouble replicating any issues we find in the one or two play sessions we have had. I think the only way to fix that would be for (if I can get them to do another session) me to run replay mod and get them to write a bit of a bug report, or even if they record while playing. Anything that could help me recreate it.\n\nIt also been hard because even if I had multiple minecraft accounts to test with (I don’t) it’s always better to test with real people. Just because real people actually do things that you wouldn’t have thought of. \n\nAnyway this is just me talking about software development lol. If you’re interested I’m going to make both the world and the server setup available on GitHub. I’ll also get a version out that doesn’t require any mods (the current one uses a single mod for changing players skins in the game) so that will be cool.\n\nAnyway, thanks for reading\n",
				"date_published": "2024-01-24T19:57:48+11:00",
				"url": "https://blog.techyte.net/2024/01/24/among-us-in.html"
			},
			{
				"id": "http://techyte.micro.blog/2024/01/24/oversimplified-uploaded-lets.html",
				
				"content_html": "<p>oversimplified uploaded lets goooo</p>\n",
				"content_text": "oversimplified uploaded lets goooo\n",
				"date_published": "2024-01-24T19:47:34+11:00",
				"url": "https://blog.techyte.net/2024/01/24/oversimplified-uploaded-lets.html"
			},
			{
				"id": "http://techyte.micro.blog/2023/12/03/cheapest-excuse-for.html",
				"title": "Cheapest excuse for a blog post",
				"content_html": "<p>Was going to write a thing on how simplistic the left and right polotical spectrum is but I honestly don’t know enough and couldn’t do it justice. If your interested there are plenty of YouTube videos and articles going into it but at least for now I’ll stick to history and Ideology. Anyway I’d like to let you know that I’m working on a small thing on world wars but sadly I can’t.</p>\n",
				"content_text": "Was going to write a thing on how simplistic the left and right polotical spectrum is but I honestly don’t know enough and couldn’t do it justice. If your interested there are plenty of YouTube videos and articles going into it but at least for now I’ll stick to history and Ideology. Anyway I’d like to let you know that I’m working on a small thing on world wars but sadly I can’t.\n",
				"date_published": "2023-12-03T22:37:40+11:00",
				"url": "https://blog.techyte.net/2023/12/03/cheapest-excuse-for.html",
				"tags": ["GeopoliticsHistory"]
			},
			{
				"id": "http://techyte.micro.blog/2023/12/01/the-ideology-of.html",
				"title": "The ideology of the Axis Powers",
				"content_html": "<p>THIS IS NOT AN ENDORSEMENT OF ANY IDEOLOGIES TALKED ABOUT IT IS MERELY A DISSCUSION ON THEM!</p>\n<p>Was thinking about this today, during WW2 the axis powers were not just refered to as all facist, you obviously had facist Italy and the other two definitely fell under thr umbrella of ‘facist’ but instead they are refered to as ‘Nazi Germany’ and ‘Imperial Japan’. I think this is interesting because it shows the slightly differing ideology between each nation. Facist Italy was just that, facist, incredibly militaristic and nationalistic but nothing really special other than wanting to re-establish the roman empire.</p>\n<p>Then you have Nazi Germany who were driven by, you guesed it, Nazisim. This was basically Hitlers brand of facisim that focused on not only driving Germans forward but everyone else out. Finally you have Imperial Japan which I think is the most interesting, they were undoubtedly facist (millitaristic and nationalistic) but their conquest and motivation for war was much more focused on building an empire rather than just because they were facist, sure they (at least the leadership) thought they had a divine right to win and subjugate the rest of the world but that was more justification rather than motivation, the motivation was Imperialism.</p>\n<p>And I think thats the key point about these names, they represent each nations individual motivation, justification and overall just the driving factor behind each of their desire for war. They all had their own brand of facisim. Anyway I thought this was interesting and worth writing something about it.</p>\n",
				"content_text": "THIS IS NOT AN ENDORSEMENT OF ANY IDEOLOGIES TALKED ABOUT IT IS MERELY A DISSCUSION ON THEM! \n\nWas thinking about this today, during WW2 the axis powers were not just refered to as all facist, you obviously had facist Italy and the other two definitely fell under thr umbrella of ‘facist’ but instead they are refered to as ‘Nazi Germany’ and ‘Imperial Japan’. I think this is interesting because it shows the slightly differing ideology between each nation. Facist Italy was just that, facist, incredibly militaristic and nationalistic but nothing really special other than wanting to re-establish the roman empire. \n\nThen you have Nazi Germany who were driven by, you guesed it, Nazisim. This was basically Hitlers brand of facisim that focused on not only driving Germans forward but everyone else out. Finally you have Imperial Japan which I think is the most interesting, they were undoubtedly facist (millitaristic and nationalistic) but their conquest and motivation for war was much more focused on building an empire rather than just because they were facist, sure they (at least the leadership) thought they had a divine right to win and subjugate the rest of the world but that was more justification rather than motivation, the motivation was Imperialism. \n\nAnd I think thats the key point about these names, they represent each nations individual motivation, justification and overall just the driving factor behind each of their desire for war. They all had their own brand of facisim. Anyway I thought this was interesting and worth writing something about it.\n",
				"date_published": "2023-12-01T22:44:03+11:00",
				"url": "https://blog.techyte.net/2023/12/01/the-ideology-of.html",
				"tags": ["GeopoliticsHistory"]
			},
			{
				"id": "http://techyte.micro.blog/2023/11/30/followup-australian-republicanism.html",
				"title": "Follow-Up Australian republicanism and government",
				"content_html": "<p>So to follow up on yesterdays post I learned some more about Australian republicanism and Australian government in general. First of all is that the defeat of the voice to parliament basically means that if a republic referendum was held right after and failed it would be a huge blow, 2 back to back rejections does not look good. I also found out that Australian Prime Ministers have no term limits like thr U.S does (also the U.S’s term limits only come from an ammendment, the 10th I believe). Just some random interesting facts to prove that learning dosent happen all at once and even small things can take days to begin to learn about. (im trying to add messages and morals to the end if these and i dont know if i hate or despise it) anyway thanks for reasint.</p>\n",
				"content_text": "So to follow up on yesterdays post I learned some more about Australian republicanism and Australian government in general. First of all is that the defeat of the voice to parliament basically means that if a republic referendum was held right after and failed it would be a huge blow, 2 back to back rejections does not look good. I also found out that Australian Prime Ministers have no term limits like thr U.S does (also the U.S’s term limits only come from an ammendment, the 10th I believe). Just some random interesting facts to prove that learning dosent happen all at once and even small things can take days to begin to learn about. (im trying to add messages and morals to the end if these and i dont know if i hate or despise it) anyway thanks for reasint.\n",
				"date_published": "2023-11-30T23:08:47+11:00",
				"url": "https://blog.techyte.net/2023/11/30/followup-australian-republicanism.html",
				"tags": ["GeopoliticsHistory","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/11/29/australia-and-monarchys.html",
				"title": "Australia and monarchy’s or republics",
				"content_html": "<p>ALR so I just went down a rabbit hole on Australian politics, constitution and monarchy vs republic. There was actually a referendum on whether to become a republic in 1999 but it failed, mostly because of the model of republic that was presented (the president would be chosen by parliament rather than by popular vote). After the queens death albanese stated that, out of respect, he would not push a republic referendum until at least his second term if it occurs. So it is entirely possible that in the next few years we will have a referendum on it. The only thing it would actually do is signify that Australia is no longer tied, in any way to the UK and we are fully independent. The president probably wouldn’t have any real power but be more of a person that is supposed to personify the nation and act as a diplomat. Personally I am 100% in favour of a republic and monarchys just seem like a relic from the past. Either way there was a lot more to this discussion than I thought there would be (as with all things) and I hope you found this interesting.</p>\n",
				"content_text": "ALR so I just went down a rabbit hole on Australian politics, constitution and monarchy vs republic. There was actually a referendum on whether to become a republic in 1999 but it failed, mostly because of the model of republic that was presented (the president would be chosen by parliament rather than by popular vote). After the queens death albanese stated that, out of respect, he would not push a republic referendum until at least his second term if it occurs. So it is entirely possible that in the next few years we will have a referendum on it. The only thing it would actually do is signify that Australia is no longer tied, in any way to the UK and we are fully independent. The president probably wouldn’t have any real power but be more of a person that is supposed to personify the nation and act as a diplomat. Personally I am 100% in favour of a republic and monarchys just seem like a relic from the past. Either way there was a lot more to this discussion than I thought there would be (as with all things) and I hope you found this interesting.\n",
				"date_published": "2023-11-29T22:22:43+11:00",
				"url": "https://blog.techyte.net/2023/11/29/australia-and-monarchys.html",
				"tags": ["GeopoliticsHistory","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/11/28/the-closer-look.html",
				"title": "The Closer Look",
				"content_html": "<p>So my current obsession is this YouTube channel called “the closer look”. The guy that runs it does video essays on movies and screenwriting, breaking down why specific things work and why other things don’t. One of my favourite ones that I have watched so far is his video on why the messages in Avatar just don’t hit the spot/work well. He also has a video on Wonder Woman 1984 that I found really interesting. I’ve always wanted to write something and this channel has given me some motivation, idk where it will go but my hopes are high. It’s a wonderful channel if your looking for writing advice and/or lessons and I wholeheartedly recommend you check it out!</p>\n<p><a href=\"https://www.youtube.com/channel/UCI9DUIgtRGHNH_HmSTcfUbA\">Channel Link</a></p>\n",
				"content_text": "So my current obsession is this YouTube channel called “the closer look”. The guy that runs it does video essays on movies and screenwriting, breaking down why specific things work and why other things don’t. One of my favourite ones that I have watched so far is his video on why the messages in Avatar just don’t hit the spot/work well. He also has a video on Wonder Woman 1984 that I found really interesting. I’ve always wanted to write something and this channel has given me some motivation, idk where it will go but my hopes are high. It’s a wonderful channel if your looking for writing advice and/or lessons and I wholeheartedly recommend you check it out!\r\n\r\n[Channel Link](https://www.youtube.com/channel/UCI9DUIgtRGHNH_HmSTcfUbA)\n",
				"date_published": "2023-11-28T21:26:46+11:00",
				"url": "https://blog.techyte.net/2023/11/28/the-closer-look.html",
				"tags": ["Movies"]
			},
			{
				"id": "http://techyte.micro.blog/2023/11/27/short-stories-and.html",
				"title": "Short stories and ‘fancy’ writing",
				"content_html": "<p>As I’ve been reading more and more short stories and light novels I’ve noticed that the writing style always follows a similar pattern. It starts off really descriptive and detailed as the Author tries to prove that they can write like that and this isn’t going to be like any other story, it’s going to be detailed! The one caveat of this is that it often feels forced and a bit ostentatious. After a few paragrpahs, the Author seems to notice (or is forced to because of) that this style of writing is just not sustainable for them (and they do it poorly at that) and it eventually settles down into the real quality of the their writing. I think this is interesting because of how often I see it and how a few weeks ago before I noticed this it would be the exact kind of mistake that I would make. All it does is make you seem less competent, for example stories that don’t do this and kick off with the same style and quality feel so much better and interesting to read from the get go (this is also partly due to the fact that because they are not focusing on fancy writing they can actually write better and more engaging scenes). Anyway I found this funny and is one of an endless number of things that circles through my head daily.</p>\n",
				"content_text": "As I’ve been reading more and more short stories and light novels I’ve noticed that the writing style always follows a similar pattern. It starts off really descriptive and detailed as the Author tries to prove that they can write like that and this isn’t going to be like any other story, it’s going to be detailed! The one caveat of this is that it often feels forced and a bit ostentatious. After a few paragrpahs, the Author seems to notice (or is forced to because of) that this style of writing is just not sustainable for them (and they do it poorly at that) and it eventually settles down into the real quality of the their writing. I think this is interesting because of how often I see it and how a few weeks ago before I noticed this it would be the exact kind of mistake that I would make. All it does is make you seem less competent, for example stories that don’t do this and kick off with the same style and quality feel so much better and interesting to read from the get go (this is also partly due to the fact that because they are not focusing on fancy writing they can actually write better and more engaging scenes). Anyway I found this funny and is one of an endless number of things that circles through my head daily.\n",
				"date_published": "2023-11-27T23:22:56+11:00",
				"url": "https://blog.techyte.net/2023/11/27/short-stories-and.html"
			},
			{
				"id": "http://techyte.micro.blog/2023/11/26/napoleon-movie.html",
				"title": "Napoleon Movie",
				"content_html": "<p><em>plays spiderverse music</em> Lets do this again…</p>\n<p>holla. Watched Napolean today. REALLY good at the start especially with the siege of toulon. It gets iffy after his corronation and theres this really long hit about him trying to get an heir that could have been spent on his Russian Campaign or any of the other battles. The 3rd act is really fast and obviously needed more time. They skip over basically everything after his kid (with the exception of the battle of Waterloo) and his later life is just not done justice. It feels to me like it was intended to be a 3.5-4 hour movie but they were forced to cut it down to show in theaters. One thing that I think was done well but still could have done with more time was the Battle of Waterloo, it didn’t really talk about how important it was and if you haden’t heard about it before it was kinda out of the blue but I really liked it as a battle scene. Theres one bit where the English all form squares and shoot down thre circling French cavalry that for some reason I just LOVED (but also hated because the French were litterally just going in circles like wtf do something lol). Anyway it was a very accurate movie, looked and sounded as I would expect from this kind of movie and all it needed is a longer runtime to become one of the best movies of the year. Oh also before I forget the acting was amazing, especially Pheonix just captured everything about Napolean perfectly.</p>\n",
				"content_text": "*plays spiderverse music* Lets do this again…\r\n\r\nholla. Watched Napolean today. REALLY good at the start especially with the siege of toulon. It gets iffy after his corronation and theres this really long hit about him trying to get an heir that could have been spent on his Russian Campaign or any of the other battles. The 3rd act is really fast and obviously needed more time. They skip over basically everything after his kid (with the exception of the battle of Waterloo) and his later life is just not done justice. It feels to me like it was intended to be a 3.5-4 hour movie but they were forced to cut it down to show in theaters. One thing that I think was done well but still could have done with more time was the Battle of Waterloo, it didn’t really talk about how important it was and if you haden’t heard about it before it was kinda out of the blue but I really liked it as a battle scene. Theres one bit where the English all form squares and shoot down thre circling French cavalry that for some reason I just LOVED (but also hated because the French were litterally just going in circles like wtf do something lol). Anyway it was a very accurate movie, looked and sounded as I would expect from this kind of movie and all it needed is a longer runtime to become one of the best movies of the year. Oh also before I forget the acting was amazing, especially Pheonix just captured everything about Napolean perfectly.\r\n\r\n",
				"date_published": "2023-11-26T21:27:56+11:00",
				"url": "https://blog.techyte.net/2023/11/26/napoleon-movie.html",
				"tags": ["GeopoliticsHistory","Movies"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/29/china-taiwan-and.html",
				"title": "China, Taiwan and Mongolia",
				"content_html": "<p>TIL: Due to Taiwans obviously bullshit claim to the entirety of China, they also have to technically lay claim to mongolia, small parts of Russia and parts of half a dozen or so countries that border China. This is because the area they lay claim to actually originates from the previous Qing dynasty that both the ROC (Taiwan) and PRC (Mainland China) claim to be the successor to. Despite this Taiwan maintains not insignificant relations with mongolia and its all a big web of bureaucracy woven by Taiwan to not piss of China.</p>\n<p>EDIT: uhhhh so a few months later and ive seen kinda conflicting sources on the actual status of taiwans and chinas claim over each other and mongolia so maybe just distigard this until i can get some actual sources and evidence lol</p>\n",
				"content_text": "TIL: Due to Taiwans obviously bullshit claim to the entirety of China, they also have to technically lay claim to mongolia, small parts of Russia and parts of half a dozen or so countries that border China. This is because the area they lay claim to actually originates from the previous Qing dynasty that both the ROC (Taiwan) and PRC (Mainland China) claim to be the successor to. Despite this Taiwan maintains not insignificant relations with mongolia and its all a big web of bureaucracy woven by Taiwan to not piss of China.\n\nEDIT: uhhhh so a few months later and ive seen kinda conflicting sources on the actual status of taiwans and chinas claim over each other and mongolia so maybe just distigard this until i can get some actual sources and evidence lol\n",
				"date_published": "2023-10-29T22:07:01+11:00",
				"url": "https://blog.techyte.net/2023/10/29/china-taiwan-and.html",
				"tags": ["GeopoliticsHistory","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/28/ww-documentary.html",
				"title": "WW2 Documentary",
				"content_html": "<p>Was watching a WW2 doco today and it really was good, except for the fact that they went over litterally every batlle faught in the war. Like I get trying to be comprehensive but I don’t need to know every little scuffle between the U.S and Imperial Japan. Either way it was really good and because it was so comprehensive it went over some stuff that most things skip over, like the details of the North African battles.</p>\n<p>P.S does this count as a movie review…???</p>\n",
				"content_text": "Was watching a WW2 doco today and it really was good, except for the fact that they went over litterally every batlle faught in the war. Like I get trying to be comprehensive but I don’t need to know every little scuffle between the U.S and Imperial Japan. Either way it was really good and because it was so comprehensive it went over some stuff that most things skip over, like the details of the North African battles.\r\n\r\nP.S does this count as a movie review…???\n",
				"date_published": "2023-10-28T22:22:17+11:00",
				"url": "https://blog.techyte.net/2023/10/28/ww-documentary.html",
				"tags": ["GeopoliticsHistory","Movies"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/27/havent-been-blogin.html",
				
				"content_html": "<p>havent been blogin cause ive been drawing countryballs (or polandballs depending on who you ask)</p>\n<p><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --><!-- raw HTML omitted --></p>\n",
				"content_text": "havent been blogin cause ive been drawing countryballs (or polandballs depending on who you ask)\n\n<img src=\"uploads/2023/germany-2008.png\" width=\"313\" height=\"600\" alt=\"\"><img src=\"uploads/2023/823b2eb1fc.png\" width=\"600\" height=\"477\" alt=\"\"><img src=\"uploads/2023/all-states-in-the-european-union.png\" width=\"600\" height=\"484\" alt=\"\"><img src=\"uploads/2023/average-australian.png\" width=\"600\" height=\"375\" alt=\"\"><img src=\"uploads/2023/soviet-and-england.png\" width=\"600\" height=\"375\" alt=\"\">\n",
				"date_published": "2023-10-27T23:35:09+11:00",
				"url": "https://blog.techyte.net/2023/10/27/havent-been-blogin.html"
			},
			{
				"id": "http://techyte.micro.blog/2023/10/24/german-war-reparations.html",
				"title": "German war reparations",
				"content_html": "<p>TIL: Even after German reunification and more than 90 years after ww1 ended, Germany still had to pay war reparations. They only paid the final amount in 2010! This meant that they were almost done paying and then the 2008 financial crisis hit, plunging them even deeper into dept and financial instability. A cruel twist of hilarious fate. Oh and Greece borrowed a shit ton from them so that didn’t help.</p>\n",
				"content_text": "TIL: Even after German reunification and more than 90 years after ww1 ended, Germany still had to pay war reparations. They only paid the final amount in 2010! This meant that they were almost done paying and then the 2008 financial crisis hit, plunging them even deeper into dept and financial instability. A cruel twist of hilarious fate. Oh and Greece borrowed a shit ton from them so that didn’t help. \n",
				"date_published": "2023-10-24T22:16:33+11:00",
				"url": "https://blog.techyte.net/2023/10/24/german-war-reparations.html",
				"tags": ["GeopoliticsHistory","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/23/german-reunification.html",
				"title": "German reunification",
				"content_html": "<p>TIL: After the collapse is the Soviet Union, the British prime minister and French president were opposed to German reunification. They ‘feared’ that Germany would revert back to its imperial tendency’s and try to reclaim territory lost in WW2. This meant that in order to appease them, the new Germany had to agree to all of these treaties and amendments that basically set its borders in the most binding way possible. This still holds up today and I think it’s a really good example to show that the allies weren’t wholly good even after the war.</p>\n",
				"content_text": "TIL: After the collapse is the Soviet Union, the British prime minister and French president were opposed to German reunification. They ‘feared’ that Germany would revert back to its imperial tendency’s and try to reclaim territory lost in WW2. This meant that in order to appease them, the new Germany had to agree to all of these treaties and amendments that basically set its borders in the most binding way possible. This still holds up today and I think it’s a really good example to show that the allies weren’t wholly good even after the war.\n",
				"date_published": "2023-10-23T22:04:34+11:00",
				"url": "https://blog.techyte.net/2023/10/23/german-reunification.html",
				"tags": ["GeopoliticsHistory","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/22/aud-vs-global.html",
				"title": "AUD vs Global Iron Price",
				"content_html": "<p>TIL: Australia’s economy is so centered around mining that you can put a graph of iron prices next to a graph of the worth of the Australian dolar it’s almost comical. As the global iron price goes up, so does the worth of the AUD! I think its both funny and interesting that a countries currency can be so dependant on one recource, I also wonder what this implies about Australias economy on the whole.</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "TIL: Australia’s economy is so centered around mining that you can put a graph of iron prices next to a graph of the worth of the Australian dolar it’s almost comical. As the global iron price goes up, so does the worth of the AUD! I think its both funny and interesting that a countries currency can be so dependant on one recource, I also wonder what this implies about Australias economy on the whole.\n\n<img src=\"uploads/2023/img-4845.png\" width=\"600\" height=\"350\" alt=\"\">\n",
				"date_published": "2023-10-22T21:03:59+11:00",
				"url": "https://blog.techyte.net/2023/10/22/aud-vs-global.html",
				"tags": ["GeopoliticsHistory","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/20/israels-iron-dome.html",
				"title": "Israels Iron Dome",
				"content_html": "<p>TIL: Israel has an &lsquo;iron dome&rsquo; missile defense system that can stop 90-95% of all incoming missiles. It was developed in the 2000&rsquo;s in cooperation with, you guessed it, the U.S and successful stopped its first missile in 2011. It works in all weather and is currently the best, most efficient and effective missile defense system in the entire world. It&rsquo;s specifically designed for a smaller state like Israel but the U.S and many other countries have actually bought iron dome systems from Israel.</p>\n",
				"content_text": "TIL: Israel has an 'iron dome' missile defense system that can stop 90-95% of all incoming missiles. It was developed in the 2000's in cooperation with, you guessed it, the U.S and successful stopped its first missile in 2011. It works in all weather and is currently the best, most efficient and effective missile defense system in the entire world. It's specifically designed for a smaller state like Israel but the U.S and many other countries have actually bought iron dome systems from Israel.\n",
				"date_published": "2023-10-20T14:00:31+11:00",
				"url": "https://blog.techyte.net/2023/10/20/israels-iron-dome.html",
				"tags": ["GeopoliticsHistory","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/19/random-stuff-learnt.html",
				"title": "Random stuff learnt in school by a good teacher",
				"content_html": "<p>TIL: Your body produces something like 7 billion red blood cells per hour! And they live on average for 150 days, your body is basically peformijg a miricle to keep you alive. I also found out that your poop is mostly dead red blood cells, hence why its brown. Red blood cells are cupped in order to retain oxygen better which I find interesting and led to me finding out that each blood cell carries hundereds of o2 molecules each. Also ~90% of the cells in your body are just bacteria that you need to survive. \nOne final thing I learned is that your body can’t get rid of heavy metals like iron and mercury. This means that you only need to take say Iron supliments for a small amount of time before you are good. It also means that there are some things around you needing to pay attention to any fish you eat because it will have eaten many smaller fish which will have eaten more smaller fish which all ends up with all the MERCURY in ALL those fish getting delivered right to you when you eat it.</p>\n<p>This was just an info dump of some of the highlights of a really interesting class I had with a really good teacher of mine. It was all tangents and only slightly related to the actual topic (blood splatter) but it was absolutely amazing and goes to show that if both teachers and students care, stuff can actually turn out well.</p>\n",
				"content_text": "TIL: Your body produces something like 7 billion red blood cells per hour! And they live on average for 150 days, your body is basically peformijg a miricle to keep you alive. I also found out that your poop is mostly dead red blood cells, hence why its brown. Red blood cells are cupped in order to retain oxygen better which I find interesting and led to me finding out that each blood cell carries hundereds of o2 molecules each. Also ~90% of the cells in your body are just bacteria that you need to survive. \r\nOne final thing I learned is that your body can’t get rid of heavy metals like iron and mercury. This means that you only need to take say Iron supliments for a small amount of time before you are good. It also means that there are some things around you needing to pay attention to any fish you eat because it will have eaten many smaller fish which will have eaten more smaller fish which all ends up with all the MERCURY in ALL those fish getting delivered right to you when you eat it.\r\n\r\nThis was just an info dump of some of the highlights of a really interesting class I had with a really good teacher of mine. It was all tangents and only slightly related to the actual topic (blood splatter) but it was absolutely amazing and goes to show that if both teachers and students care, stuff can actually turn out well.\n",
				"date_published": "2023-10-19T21:01:06+11:00",
				"url": "https://blog.techyte.net/2023/10/19/random-stuff-learnt.html",
				"tags": ["Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/17/ruble-vs-robux.html",
				"title": "Ruble vs Robux",
				"content_html": "<p>TIL: In part due to the Russian invasion of Ukraine, one Ruble is worth less than one ‘Robux’, the currency for Roblox. One USD is 10 Robux compared to almost 100 Rubles. Its value collapsed around the time of their invasion and has been falling more ever since. I think this is one of the most hilarious facts that more people need to know about lol.</p>\n",
				"content_text": "TIL: In part due to the Russian invasion of Ukraine, one Ruble is worth less than one ‘Robux’, the currency for Roblox. One USD is 10 Robux compared to almost 100 Rubles. Its value collapsed around the time of their invasion and has been falling more ever since. I think this is one of the most hilarious facts that more people need to know about lol.\n",
				"date_published": "2023-10-17T21:13:19+11:00",
				"url": "https://blog.techyte.net/2023/10/17/ruble-vs-robux.html",
				"tags": ["Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/16/earths-magnetic-poles.html",
				"title": "Earths magnetic poles",
				"content_html": "<p>TIL: The actual south magnetic pole is actually something like a few km off the coast of Antarctica lol. Both the north and the south poles have moved around a bunch over the last few decades, just 50 years ago or something the south pole was on land and its moved that far that fast. Idk I find it interesting that the poles move so often. This is all as of 2020 btw.</p>\n",
				"content_text": "TIL: The actual south magnetic pole is actually something like a few km off the coast of Antarctica lol. Both the north and the south poles have moved around a bunch over the last few decades, just 50 years ago or something the south pole was on land and its moved that far that fast. Idk I find it interesting that the poles move so often. This is all as of 2020 btw.\n",
				"date_published": "2023-10-16T22:09:59+11:00",
				"url": "https://blog.techyte.net/2023/10/16/earths-magnetic-poles.html",
				"tags": ["Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/15/silicon-shield.html",
				"title": "Silicon Shield",
				"content_html": "<p>TIL: One of the ways Taiwan deters a Chinese invasion is by basically being the largest manufacturer of microchips in the world. This means that if the Chinese were to invade, basically the entire would would go ‘nu uh’ and intervene to allow the silicon to flow. The deterrent is therefore very aptly called Taiwans ‘Silicon Shield’.</p>\n",
				"content_text": "TIL: One of the ways Taiwan deters a Chinese invasion is by basically being the largest manufacturer of microchips in the world. This means that if the Chinese were to invade, basically the entire would would go ‘nu uh’ and intervene to allow the silicon to flow. The deterrent is therefore very aptly called Taiwans ‘Silicon Shield’.\n",
				"date_published": "2023-10-15T22:20:12+11:00",
				"url": "https://blog.techyte.net/2023/10/15/silicon-shield.html",
				"tags": ["GeopoliticsHistory","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/14/til-napolean-was.html",
				
				"content_html": "<p>TIL: Napolean was like the only guy to actually make it to Moscow but when he got there they had fucking burnt it to the ground lol. Russians really do whatever it takes to stop people getting to/staying in Moscow.</p>\n",
				"content_text": "TIL: Napolean was like the only guy to actually make it to Moscow but when he got there they had fucking burnt it to the ground lol. Russians really do whatever it takes to stop people getting to/staying in Moscow.\n",
				"date_published": "2023-10-14T19:48:35+11:00",
				"url": "https://blog.techyte.net/2023/10/14/til-napolean-was.html"
			},
			{
				"id": "http://techyte.micro.blog/2023/10/13/east-and-west.html",
				"title": "East and West Berlin",
				"content_html": "<p>TIL: Despite Berlin sitting inside of East Germany, during the cold war, the U.S, Britain and France all held areas in Berlin, seperate from their areas in West Germany. Suppose I should have thought of that sooner considering I hear the term east and west berlin just as often but I guess I always though they meant their country counterparts. Also it was called the Berlin wall lol, no idea how I missed this but you learn a new thing everyday.</p>\n<p>P.S: Instead of writing a whole blog post every day I think I might try just writing something that I learnt every day and putting it on here. If I find something interesting I’ll still write about it though.\nAlso it has been brought to my attention that I don’t know how to write TL;DR. I will be correcting this mistake from now on.</p>\n",
				"content_text": "TIL: Despite Berlin sitting inside of East Germany, during the cold war, the U.S, Britain and France all held areas in Berlin, seperate from their areas in West Germany. Suppose I should have thought of that sooner considering I hear the term east and west berlin just as often but I guess I always though they meant their country counterparts. Also it was called the Berlin wall lol, no idea how I missed this but you learn a new thing everyday.\r\n\r\nP.S: Instead of writing a whole blog post every day I think I might try just writing something that I learnt every day and putting it on here. If I find something interesting I’ll still write about it though.\r\nAlso it has been brought to my attention that I don’t know how to write TL;DR. I will be correcting this mistake from now on.\n",
				"date_published": "2023-10-13T22:41:31+11:00",
				"url": "https://blog.techyte.net/2023/10/13/east-and-west.html",
				"tags": ["GeopoliticsHistory","Today I learned"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/11/middle-east-is.html",
				
				"content_html": "<p>middle east is back at again with another religious war</p>\n",
				"content_text": "middle east is back at again with another religious war\n",
				"date_published": "2023-10-11T21:15:28+11:00",
				"url": "https://blog.techyte.net/2023/10/11/middle-east-is.html",
				"tags": ["GeopoliticsHistory"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/09/update-the-significance.html",
				"title": "Update: The significance of the bombings of Hiroshima and Nagasaki on the Japanese surrender",
				"content_html": "<p>Alright so I&rsquo;ve done some more research on how influential the bombings of Hiroshima and Nagasaki were to Japans surrender.</p>\n<p>The general consensus is that the war was going badly and the bomb was, to the Japanese leadership, really no different than a regular bombing. They were already planning on surrendering due to the impending invasion by the U.S and USSR. The bomb simply provided an easy excuse that they could point to, in order to cover up the fact that they were already loosing the war.</p>\n<p>It meant that they could preserve the &lsquo;perfect emperor&rsquo; façade because it wouldn&rsquo;t have been his fault, it was the allies that had suddenly created this magical bomb that forced the Japanese to surrender! Basically they were power hungry dictators.</p>\n<p>So I was wrong about not believing that the Japanese leadership saw the bombings as &lsquo;just another&rsquo; bombing. They were willing to keep being bombed if it meant preserving their power and pride.</p>\n<p>TLDR; The war was going badly and the bombings were a good excuse for Japanese leadership to ignore their failures during the war.</p>\n",
				"content_text": "Alright so I've done some more research on how influential the bombings of Hiroshima and Nagasaki were to Japans surrender.\r\n\r\nThe general consensus is that the war was going badly and the bomb was, to the Japanese leadership, really no different than a regular bombing. They were already planning on surrendering due to the impending invasion by the U.S and USSR. The bomb simply provided an easy excuse that they could point to, in order to cover up the fact that they were already loosing the war.\r\n\r\nIt meant that they could preserve the 'perfect emperor' façade because it wouldn't have been his fault, it was the allies that had suddenly created this magical bomb that forced the Japanese to surrender! Basically they were power hungry dictators.\r\n\r\nSo I was wrong about not believing that the Japanese leadership saw the bombings as 'just another' bombing. They were willing to keep being bombed if it meant preserving their power and pride.\r\n\r\nTLDR; The war was going badly and the bombings were a good excuse for Japanese leadership to ignore their failures during the war.\n",
				"date_published": "2023-10-09T20:36:03+11:00",
				"url": "https://blog.techyte.net/2023/10/09/update-the-significance.html",
				"tags": ["GeopoliticsHistory"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/08/the-actual-importance.html",
				"title": "The actual importance of the U.S’s bombing of Hiroshima and Nagasaki",
				"content_html": "<p>While researching U.S military spending I came across an article arguing that the common narrative that Japan only surrendered because of the nuclear bombings of Hiroshima and Nagasaki is not entirely accurate.</p>\n<p><a href=\"https://foreignpolicy.com/2013/05/30/the-bomb-didnt-beat-japan-stalin-did/\">Article Link</a></p>\n<p>It has some interesting points but it mainly boils down to 2 main things (I’ll explain them and then give my opinion).</p>\n<p>The first thing they mention is how it happened at a time where every other day, a Japanese city was being bombed. This caused Japan to see the nuking on Hiroshima (and 3 days later Nagasaki) as more or less just an upgraded and slightly more powerful attack, and therefore weren’t going to surrender just because something that was already going on had slightly changed.</p>\n<p>The second reason is the Soviet Unions plans to invade Japan from the north, combined with Britain and the U.S’s invasion from the south was looking to be increasingly devastating for Japan. The USSR has only recently declared war on Japan and had already proven that they could easily sweep into and take critical Japanese city’s. For Japan, a joint Allied invasion from the north and south was un-winnable.</p>\n<p>One of the reasons that people see the bombings as the final stroke is because the Japanese surrender came 6 days after the bombings and it seems easy to connect to two. Something the article points out though is that the full report on the Hiroshima bombing didn’t reach the Japanese leadership until the day after they surrendered.</p>\n<p>It then goes on to explain the reasoning for each countries pushing the idea of the nukes being the deciding factor.</p>\n<p>OPINION PART THAT I WILL PROBABLY REGRET ONE DAY STARTS HERE:</p>\n<p>I think the bombings did have an impact on the surrender. The article talks about the statistics of how much each bombing destroyed of each respective city but I think this is a bit misleading. If you look at how many people died in the Hiroshima bombings and compare that to the other, standard bombings, the nuclear bomb did far more actual damage.</p>\n<p>I also think implying that the report not getting to the leadership until after they surrendered meaning that they had no idea that it happened is a bit weird. They would definitely had gotten some reports if a city was destroyed, even if it was a common occurrence.</p>\n<p>I do agree however that it wasn&rsquo;t as big a part of the decision as most people make it out to be. It  was certainly a part of why the surrendered, but the impending invasion by England, the U.S, and most importantly the Soviets would have been the main reasoning.</p>\n<p>I would like to state that I have no credentials to be making these opinions but this is my blog and I make the rules ‘round here.</p>\n<p>I recommend you read the article and I will probably read more on the topic and might write another small opinion piece on it when I’m more informed.</p>\n<p>Thanks for reading.</p>\n",
				"content_text": "While researching U.S military spending I came across an article arguing that the common narrative that Japan only surrendered because of the nuclear bombings of Hiroshima and Nagasaki is not entirely accurate. \n\n[Article Link](https://foreignpolicy.com/2013/05/30/the-bomb-didnt-beat-japan-stalin-did/)\n\nIt has some interesting points but it mainly boils down to 2 main things (I’ll explain them and then give my opinion).\n\nThe first thing they mention is how it happened at a time where every other day, a Japanese city was being bombed. This caused Japan to see the nuking on Hiroshima (and 3 days later Nagasaki) as more or less just an upgraded and slightly more powerful attack, and therefore weren’t going to surrender just because something that was already going on had slightly changed.\n\nThe second reason is the Soviet Unions plans to invade Japan from the north, combined with Britain and the U.S’s invasion from the south was looking to be increasingly devastating for Japan. The USSR has only recently declared war on Japan and had already proven that they could easily sweep into and take critical Japanese city’s. For Japan, a joint Allied invasion from the north and south was un-winnable. \n\nOne of the reasons that people see the bombings as the final stroke is because the Japanese surrender came 6 days after the bombings and it seems easy to connect to two. Something the article points out though is that the full report on the Hiroshima bombing didn’t reach the Japanese leadership until the day after they surrendered.\n\nIt then goes on to explain the reasoning for each countries pushing the idea of the nukes being the deciding factor.\n\nOPINION PART THAT I WILL PROBABLY REGRET ONE DAY STARTS HERE:\n\nI think the bombings did have an impact on the surrender. The article talks about the statistics of how much each bombing destroyed of each respective city but I think this is a bit misleading. If you look at how many people died in the Hiroshima bombings and compare that to the other, standard bombings, the nuclear bomb did far more actual damage.\n\nI also think implying that the report not getting to the leadership until after they surrendered meaning that they had no idea that it happened is a bit weird. They would definitely had gotten some reports if a city was destroyed, even if it was a common occurrence.\n\nI do agree however that it wasn't as big a part of the decision as most people make it out to be. It  was certainly a part of why the surrendered, but the impending invasion by England, the U.S, and most importantly the Soviets would have been the main reasoning.\n\nI would like to state that I have no credentials to be making these opinions but this is my blog and I make the rules ‘round here.\n\nI recommend you read the article and I will probably read more on the topic and might write another small opinion piece on it when I’m more informed.\n\nThanks for reading.\n",
				"date_published": "2023-10-08T22:19:15+11:00",
				"url": "https://blog.techyte.net/2023/10/08/the-actual-importance.html",
				"tags": ["GeopoliticsHistory"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/07/climate-greenwashing.html",
				"title": "Climate Greenwashing",
				"content_html": "<p>A few days ago I watched a really interesting and eye-opening video by Think That Through (T3) on Kurzgesagt - In a nutshell. It was on Kurzgesagt&rsquo;s climate videos and how they provide a very narrow and specific way of thinking about climate change and how to solve it.</p>\n<p>Video link: <a href=\"https://youtu.be/uCuy1DaQzWI\">Kurzgesagt and the art of climate greenwashing</a></p>\n<p>I started writing a few paragraphs summarizing the video but released that I would have to either omit a lot of interesting and crucial information or just do a bad job of expressing everything that they did. I might write another blog post just summarizing it for myself later, but in the meantime just go watch the video. Its really interesting and only talks about the things that T3 have a problem with. It isn&rsquo;t one of those doom and gloom videos trying to get views by making out there claims. They have real and well thought out arguments and if you take the time to watch it I think its well worth the hour and a half.</p>\n<p>TLDR; cannot express how much you should watch this video. <strong>GO WATCH IT!!</strong>.</p>\n",
				"content_text": "A few days ago I watched a really interesting and eye-opening video by Think That Through (T3) on Kurzgesagt - In a nutshell. It was on Kurzgesagt's climate videos and how they provide a very narrow and specific way of thinking about climate change and how to solve it.\n\nVideo link: [Kurzgesagt and the art of climate greenwashing](https://youtu.be/uCuy1DaQzWI)\n\nI started writing a few paragraphs summarizing the video but released that I would have to either omit a lot of interesting and crucial information or just do a bad job of expressing everything that they did. I might write another blog post just summarizing it for myself later, but in the meantime just go watch the video. Its really interesting and only talks about the things that T3 have a problem with. It isn't one of those doom and gloom videos trying to get views by making out there claims. They have real and well thought out arguments and if you take the time to watch it I think its well worth the hour and a half.\n\nTLDR; cannot express how much you should watch this video. **GO WATCH IT!!**.\n",
				"date_published": "2023-10-07T22:21:10+11:00",
				"url": "https://blog.techyte.net/2023/10/07/climate-greenwashing.html",
				"tags": ["Climate Change","Philosophy"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/06/researching-us-military.html",
				"title": "Researching U.S military spending",
				"content_html": "<p>Been researching why the U.S.A has such a large military nowadays. It&rsquo;s actually really interesting, it covers topics like geography and the philosophy of the U.S. I am in no way qualified to write anything definitive but I&rsquo;m writing a summary that I might put on here. I&rsquo;ll be like a timeline/ideological/geographical rundown of all the reasons behind the seemingly excessive U.S military spending.</p>\n<p>Disclaimer: I am 15 years old and have no idea what I&rsquo;m doing. This will more be like what I&rsquo;ve learnt rather than an informative piece.</p>\n",
				"content_text": "Been researching why the U.S.A has such a large military nowadays. It's actually really interesting, it covers topics like geography and the philosophy of the U.S. I am in no way qualified to write anything definitive but I'm writing a summary that I might put on here. I'll be like a timeline/ideological/geographical rundown of all the reasons behind the seemingly excessive U.S military spending.\n\nDisclaimer: I am 15 years old and have no idea what I'm doing. This will more be like what I've learnt rather than an informative piece.\n",
				"date_published": "2023-10-06T14:43:06+11:00",
				"url": "https://blog.techyte.net/2023/10/06/researching-us-military.html",
				"tags": ["GeopoliticsHistory"]
			},
			{
				"id": "http://techyte.micro.blog/2023/10/05/heheheheheheheheheheheheheheheheheheheheh-i-have.html",
				
				"content_html": "<p>heheheheheheheheheheheheheheheheheheheheh i have a blog now no one is safe</p>\n",
				"content_text": "heheheheheheheheheheheheheheheheheheheheh i have a blog now no one is safe\n",
				"date_published": "2023-10-05T22:00:17+11:00",
				"url": "https://blog.techyte.net/2023/10/05/heheheheheheheheheheheheheheheheheheheheh-i-have.html"
			}
	]
}
